app/controllers/apartment_requests_controller.rb

    def create
        @apartment_request = ApartmentRequest.new(apartment: @apartment, applicant: current_user, status: :pending)
        if @apartment_request.save
---
INSERT INTO "apartment_requests" ("apartment_id", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["apartment_id", 1], ["user_id", 1], ["status", 0], ["created_at", "2024-03-02 21:23:07.811671"], ["updated_at", "2024-03-02 21:23:07.811671"]]

    def update
        if params[:status] == "approved"
        @apartment_request.approve
        elsif params[:status] == "denied"
        @apartment_request.deny
        else
        @apartment_request.update(status: params[:status])
---
UPDATE "apartment_requests" SET "status" = $1, "updated_at" = $2 WHERE "apartment_requests"."id" = $3  [["status", 1], ["updated_at", "2024-03-02 21:58:45.414424"], ["id", 1]]

    def destroy
        @apartment_request.destroy!
---
DELETE FROM "apartment_requests" WHERE "apartment_requests"."id" = $1  [["id", 1]]

        def set_apartment
            @apartment = Apartment.find(params[:apartment_id])
---
SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        def set_apartment_request
            @apartment_request = @apartment.apartment_requests.find(params[:id])
---
SELECT "apartment_requests".* FROM "apartment_requests" WHERE "apartment_requests"."apartment_id" = $1 AND "apartment_requests"."id" = $2 LIMIT $3  [["apartment_id", 1], ["id", 1], ["LIMIT", 1]]