app/controllers/apartments_controller.rb

  def index
    @apartments = Apartment.all
---
SELECT "apartments".* FROM "apartments"

  def create
    @apartment = Apartment.new(apartment_params)

    respond_to do |format|
      if @apartment.save
---
INSERT INTO "apartments" ("street_address", "bedrooms", "rent", "notes", "neighborhood_id", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def occupy
    current_user.apartment_id = @apartment.id
    if current_user.save
---
UPDATE "users" SET "updated_at" = $1, "apartment_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-02-22 08:06:47.865362"], ["apartment_id", 1], ["id", 1]]

  def vacate
    current_user.apartment_id = nil
    if current_user.save
---
UPDATE "users" SET "updated_at" = $1, "apartment_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-02-22 08:06:54.053433"], ["apartment_id", nil], ["id", 1]]

    def set_apartment
      @apartment = Apartment.find(params[:id])
      @pending_applications = @apartment.apartment_requests.where(status: :pending).includes(:applicant => :profile)
---
SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "apartment_requests".* FROM "apartment_requests" WHERE "apartment_requests"."apartment_id" = $1 AND "apartment_requests"."status" = $2  [["apartment_id", 1], ["status", 0]]

    def set_form_values
      @cities = City.all
      @neighborhoods = Neighborhood.all
---
SELECT "cities".* FROM "cities"
SELECT "neighborhoods".* FROM "neighborhoods"