app/controllers/cities_controller.rb

SELECT "apartments".* FROM "apartments" WHERE "apartments"."city_id" = $1  [["city_id", 3]]
---
  def show
    @apartments = Apartment.where(city_id: @city.id)

INSERT INTO "cities" ("name", "state", "created_at", "updated_at", "country") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Durham"], ["state", "NC"], ["created_at", "2024-02-22 02:39:53.886117"], ["updated_at", "2024-02-22 02:39:53.886117"], ["country", "USA"]]
---
  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save

UPDATE "cities" SET "updated_at" = $1, "country" = $2 WHERE "cities"."id" = $3  [["updated_at", "2024-02-09 05:01:00.027343"], ["country", "LOLO"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @city.update(city_params)

DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 2]]
---
  def destroy
    @city.destroy!