app/controllers/neighborhoods_controller.rb

  def create
    @neighborhood = @city.neighborhoods.build(neighborhood_params)

    respond_to do |format|
      if @neighborhood.save
---
INSERT INTO "neighborhoods" ("name", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Duke"], ["city_id", 2], ["created_at", "2024-02-22 02:38:33.402255"], ["updated_at", "2024-02-22 02:38:33.402255"]]

  def update
    respond_to do |format|
      if @neighborhood.update(neighborhood_params)
---
UPDATE "neighborhoods" SET "name" = $1, "updated_at" = $2 WHERE "neighborhoods"."id" = $3  [["name", "dukep"], ["updated_at", "2024-02-22 02:42:25.613299"], ["id", 5]]

  def destroy
    @neighborhood.destroy!
---
DELETE FROM "neighborhoods" WHERE "neighborhoods"."id" = $1  [["id", 2]]

    def set_city
      @city = City.find(params[:city_id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_neighborhood
      @neighborhood = @city.neighborhoods.find(params[:id])
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."city_id" = $1 AND "neighborhoods"."id" = $2 LIMIT $3  [["city_id", 2], ["id", 2], ["LIMIT", 1]]

    def set_form_values
      @cities = City.all
---
SELECT "cities".* FROM "cities"