app/controllers/register_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "asdfasdf@asdfasfd"], ["password_digest", "[FILTERED]"], ["created_at", "2024-02-15 18:33:06.063613"], ["updated_at", "2024-02-15 18:33:06.063613"]]
---
  def create
    @user = User.new(email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation])
    if @user.save