app/views/cities/show.html.erb

SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."city_id" = $1  [["city_id", 1]]
---
      <ul>
      <% @city.neighborhoods.each do |neighborhood| %>