app/models/apartment_request.rb

  def approve
    self.update(status: :approved)
    applicant.apartment_requests.where(status: :pending).update_all(status: :superseded)
---
UPDATE "apartment_requests" SET "status" = $1, "updated_at" = $2 WHERE "apartment_requests"."id" = $3  [["status", 1], ["updated_at", "2024-03-02 21:58:45.414424"], ["id", 1]]
UPDATE "apartment_requests" SET "status" = $1 WHERE "apartment_requests"."user_id" = $2 AND "apartment_requests"."status" = $3  [["status", 3], ["user_id", 2], ["status", 0]]

  def deny
    self.update(status: :denied)
---
UPDATE "apartment_requests" SET "status" = $1, "updated_at" = $2 WHERE "apartment_requests"."id" = $3  [["status", 2], ["updated_at", "2024-03-02 21:59:25.073200"], ["id", 2]]