app/models/user.rb

  def create_profile
    name = email.split("@").first
    new_profile = self.build_profile(name: name)
    new_profile.save!
---
INSERT INTO "profiles" ("name", "biography", "cleanliness", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "will"], ["biography", nil], ["cleanliness", nil], ["user_id", 1], ["created_at", "2024-03-02 21:25:59.717017"], ["updated_at", "2024-03-02 21:25:59.717017"]]